# FieldType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..FieldType Property
ScheduleField Class See Also
---
The type of data displayed by the field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ScheduleFieldType FieldType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FieldType As ScheduleFieldType
	Get
```

Visual C++
---
```text
public:
property ScheduleFieldType FieldType {
	ScheduleFieldType get ();
}
```

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace